Core/src/DataProcessors/ЗагрузкаКурсовВалютГрузия/ЗагрузкаКурсовВалютГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКурсовВалютГрузия</name>
</mdclass:DataProcessor>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/СпособыУстановкиКурсаВалюты/СпособыУстановкиКурсаВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыУстановкиКурсаВалюты</name>
  <enumValues>
    <name>ЗагрузкаИзИнтернета</name>
  </enumValues>
  <enumValues>
    <name>РучнойВвод</name>
  </enumValues>
  <enumValues>
    <name>НаценкаНаКурсДругойВалюты</name>
  </enumValues>
  <enumValues>
    <name>РасчетПоФормуле</name>
  </enumValues>
</mdclass:Enum>

Core/src/DataProcessors/ЗагрузкаКурсовВалютГрузия/Forms/ФормаИсторияКурсов/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьКурсиНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьКурсиНаСервере()

	
	СерверИсточник = "lari.jumpstart.ge";
	//Адрес = "/en/api/v1/nbg_currencies";
	Адрес		= "/en/api/v1/nbg_rates?currency=USD,GBP&start_date=1391212800000&end_date=1422748800000";
	unixtime	= ПолучитьUnixTS(НачалоПериода);  
	unixtime2	= ПолучитьUnixTS(КонецДня(ОкончаниеПериода)); 
	//СписокВалют = "USD,GBP";
	СписокВалют = ПолучитьСписокВалют();
	
	
	//Адрес = "/en/api/v1/nbg_rates?currency=" + СписокВалют + "&start_date=" + unixtime + "&end_date=" + unixtime2;
	Адрес = "/en/api/v1/nbg_rates?currency=" + СписокВалют + "&start_date=" + unixtime + "&end_date=" + unixtime2;
	
	НТТР = Новый HTTPСоединение(СерверИсточник,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	ИмяВременногоФайла =  КаталогВременныхФайлов() + "Currency.json";
	Попытка
		НТТР.Получить(Адрес, ИмяВременногоФайла);
		ЧтениеИзJSON(ИмяВременногоФайла);
	Исключение
		Сообщить("Неудачная попытка соединения.");
	КонецПопытки;

	
КонецПроцедуры

&НаСервере
Процедура ЧтениеИзJSON(ИмяВременногоФайла)
	
	тЧтениеJSON = Новый ЧтениеJSON;
	тЧтениеJSON.ОткрытьФайл(ИмяВременногоФайла);
	
	//объектJSON = СериализаторXDTO.ПрочитатьJSON(тЧтениеJSON);
	
	тДанные = ПрочитатьJSON(тЧтениеJSON, Ложь);
	
	Попытка
		
		Если ТипЗнч(тДанные) = Тип("Структура") И тДанные.valid = Истина Тогда
			массивВалют = тДанные.result;
			ТаблиаВалюты.Очистить();
			
			Для каждого стрВалюта Из массивВалют Цикл
				Для каждого тКурс Из стрВалюта.rates Цикл
					текСтрДата = СтрЗаменить(Строка(Формат(тКурс[0], "ЧГ=0"))," " ,"");
					текСтрДата = Лев(текСтрДата,10);
					текДата	   =  СконвертироватьВремяUnixTS(текСтрДата);
					
					Если текДата  >= НачалоПериода И текДата <= ОкончаниеПериода Тогда
						новаяСтрокаВалюти = ТаблиаВалюты.Добавить();
						ЗаполнитьЗначенияСвойств(новаяСтрокаВалюти,стрВалюта);
						
						новаяСтрокаВалюти.dateCurrency = текСтрДата;
						новаяСтрокаВалюти.Rate = тКурс[1];
						новаяСтрокаВалюти.Date = текДата; 		
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			ЗапольнитКурсовВалют(ТаблиаВалюты);
			
		Иначе
			Сообщить("Неудачная попытка соединения.");
		КонецЕсли;
		
	Исключение
		Сообщить("Неудачная попытка соединения.");
	КонецПопытки;
	
	тЧтениеJSON.Закрыть();
	
КонецПроцедуры

&НаСервере
// Возвращает время в формате UNIX 
Функция ПолучитьUnixTS(ПараметрДата) 
	Возврат Формат(УниверсальноеВремя(ПараметрДата) - '19700101', "ЧГ=0"); 
КонецФункции   


&НаСервере
//время 1с 
Функция СконвертироватьВремяUnixTS(UnixTime) 
	Возврат МестноеВремя('19700101' + UnixTime); 
КонецФункции  

&НаСервере
Функция ПолучитьСписокВалют()
	
	списокВалют = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Наименование
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.НациональнаяВалюта КАК НациональнаяВалюта
		|		ПО Валюты.Ссылка <> НациональнаяВалюта.Значение
		|ГДЕ
		|	НЕ Валюты.ПометкаУдаления
		|	И НЕ Валюты.Наименование = """"
	 	//Lazare_	 		
		|	И Валюты.СпособУстановкиКурса = ЗНАЧЕНИЕ(Перечисление.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета)";
	    //_Lazare
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если списокВалют = "" Тогда
			списокВалют = списокВалют + ВыборкаДетальныеЗаписи.Наименование;
		Иначе 
			списокВалют = списокВалют + "," + ВыборкаДетальныеЗаписи.Наименование;
		КонецЕсли;
	КонецЦикла;
	
	Возврат списокВалют;	
	
КонецФункции

&НаСервере
Процедура ЗапольнитКурсовВалют(ТаблицаВалюты)
	
	Для Каждого Стр Из ТаблицаВалюты Цикл 
		
		ВалютаСсылка = Справочники.Валюты.НайтиПоНаименованию(Стр.code);
		
		Если Не ЗначениеЗаполнено(ВалютаСсылка) Тогда 
			Продолжить;
		КонецЕсли;
			
		НЗ = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
		НЗ.Отбор.Валюта.Установить(ВалютаСсылка);
		НЗ.Отбор.Период.Установить(Стр.Date);
		НЗ.Прочитать();
		НЗ.Очистить();
		Запись = НЗ.Добавить();
		Запись.Валюта = ВалютаСсылка;
		Запись.Период = Стр.Date;
		Запись.Курс   = Стр.Rate;
		Запись.Кратность = Стр.ratio;
		Попытка
			НЗ.Записать();
			Сообщить("შევსებულია " + ВалютаСсылка.Наименование + "-ის კურსი თარიღისთვის: " + Стр.Date);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;           


КонецПроцедуры // ЗаполнитьКурсиВалют(ТаблиаВалюты)()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода	 = НачалоГода(ТекущаяДата());
	ОкончаниеПериода = (ТекущаяДата());
	
КонецПроцедуры
